function t3m1 () {
    
    console.log('t3m1 ok')
    // ------------------------------------------------------------
    // "mydrag" という クラス属性のエレメントを取得する
    // ------------------------------------------------------------
    let element = document.querySelector(".mydrag");
    console.log(element);

	// ------------------------------------------------------------
	// ドラッグ開始時に実行される関数
	// ------------------------------------------------------------
	function DragStartFunc(e){
        if(!e) e = window.event; // レガシー
        
        console.log("kitayo")

		// ------------------------------------------------------------
		// デフォルトのドラッグ機能を無効化する
		// ------------------------------------------------------------
		if(e.preventDefault){
			// デフォルトの動作を無効化する
			e.preventDefault();
		}else{
			// デフォルトの動作を無効化する（非標準）
			return false;
		}
    }



    // ------------------------------------------------------------
	// "bbb" という ID 属性のエレメントを取得する
	// ------------------------------------------------------------
    element = document.querySelector(".mydrag2");
    
    // ------------------------------------------------------------
	// ドロップ時に実行されるイベント（データを受け取る直前）
	// ------------------------------------------------------------
	element.ondrop = function (e){
		console.log("ドロップ操作を行った");
		console.log(e);
    };
    
	// ------------------------------------------------------------
	// リッスンを開始する
	// ------------------------------------------------------------
	// イベントリスナーに対応している
	if(element.addEventListener){
		element.addEventListener("dragstart" , DragStartFunc);
	// アタッチイベントに対応している
	}else if(element.attachEvent){
		element.attachEvent("ondragstart" , DragStartFunc);
	// イベントハンドラを使用する
	}else{
		element.ondragstart = DragStartFunc;
    }
    

}
export { t3m1 }