function t3m1 () {
    
    console.log('t3m1 ok')
    // ------------------------------------------------------------
    // "aaa" という ID 属性のエレメントを取得する
    // ------------------------------------------------------------
    let element = document.querySelector(".mydrag");
    console.log(element);

    // ------------------------------------------------------------
    // ドラッグ操作を開始した時に実行されるイベント
    // ------------------------------------------------------------
	element.ondragstart = function (e){
        console.log("ドラッグ操作を開始したYO");
        console.log(e);
	};
    console.log("ドラッグ操作を開始しtenai");
}
export { t3m1 }